In [4]:
import mysql.connector
import pandas as pd

# Establish a connection to the MySQL server
conn = mysql.connector.connect(
    host='localhost',
    port=3307,
    user='root',
    password='1234',
    database='data_tutorials'  # Select the 'flipkart' database
)

# Write your SQL query
query = ("""SELECT * FROM pizza_sales""")

# Use pd.read_sql_query() to execute the query and read data into a DataFrame
df = pd.read_sql_query(query, conn)

# conn.close()

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\3856056437.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [5]:
df.head(3)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,01-01-2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,01-01-2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,01-01-2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza

# **KPI Requirement**

# Total Revenue

In [8]:
query = ("""SELECT SUM(total_price) as 'Total_revenue' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\3224157371.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Total_revenue
0      817860.05

# Average order value

In [12]:
query = ("""SELECT SUM(total_price)/count(Distinct order_id)  as 'avg_order' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\607582184.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   avg_order
0  38.307262

# Total quantity Pizza Sold

In [13]:
query = ("""SELECT sum(quantity) as 'total_quantity_sold' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\364593703.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   total_quantity_sold
0              49574.0

# Total orders

In [15]:
query = ("""SELECT count(Distinct order_id) as 'Total_orders' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\4261946161.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Total_orders
0         21350

# Average Pizzas per Order

In [16]:
query = ("""SELECT sum(quantity)/count(Distinct order_id) as 'Average_Pizzas_per_Order' FROM pizza_sales""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\2434938457.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

   Average_Pizzas_per_Order
0                     2.322

# **Charts Requirement**

# Daily trends for orders

In [24]:
query = ("""SELECT DAYNAME(STR_TO_DATE(order_date, '%m/%d/%Y')) AS 'order_day', COUNT(DISTINCT order_id) AS 'Total_Orders' 
FROM pizza_sales 
GROUP BY DAYNAME(STR_TO_DATE(order_date, '%m/%d/%Y'));
;
""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\1919132637.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

  order_day  Total_Orders
0      None         21350

# Monthly Trend for Total Orders

In [26]:
query = ("""SELECT MONTHNAME(MONTH(order_date)) AS 'order_day', COUNT(DISTINCT order_id) AS 'Total_Orders' 
FROM pizza_sales 
GROUP BY order_day
""")


pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\1388705142.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

  order_day  Total_Orders
0      None         21350

# % of sales by pizza category

In [27]:
query = """select pizza_category,sum(total_price)/(select sum(total_price) 
from pizza_sales)*100 as 'perc_of_sales' from pizza_sales
group by pizza_category"""

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\837296726.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

  pizza_category  perc_of_sales
0        Classic      26.905960
1         Veggie      23.682591
2        Supreme      25.456311
3        Chicken      23.955138

# Perc of sales by pizza size

In [28]:
query = """select pizza_size,sum(total_price)/(select sum(total_price) 
from pizza_sales)*100 as 'perc_of_sales' from pizza_sales
group by pizza_size"""

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\3117171736.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

  pizza_size  perc_of_sales
0          M      30.492044
1          L      45.890333
2          S      21.773468
3         XL       1.721077
4        XXL       0.123077

# Total pizza sold by pizza category

In [30]:
query = """select pizza_category,sum(quantity) from pizza_sales
group by pizza_category """

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\1452851645.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

  pizza_category  sum(quantity)
0        Classic        14888.0
1         Veggie        11649.0
2        Supreme        11987.0
3        Chicken        11050.0

# Top 5 best sellers pizzas by revenue , total quantity and total order

Revenue

In [34]:
query = """select  pizza_name,sum(total_price) as 'total' from pizza_sales
group by pizza_name order by total desc limit 5"""

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\1489368417.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

                     pizza_name     total
0        The Thai Chicken Pizza  43434.25
1    The Barbecue Chicken Pizza  42768.00
2  The California Chicken Pizza  41409.50
3      The Classic Deluxe Pizza  38180.50
4       The Spicy Italian Pizza  34831.25

Quantity

In [35]:
query = """select  pizza_name,sum(quantity) as 'total' from pizza_sales
group by pizza_name order by total desc limit 5"""

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\4089558491.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

                   pizza_name   total
0    The Classic Deluxe Pizza  2453.0
1  The Barbecue Chicken Pizza  2432.0
2          The Hawaiian Pizza  2422.0
3         The Pepperoni Pizza  2418.0
4      The Thai Chicken Pizza  2371.0

order wise

In [36]:
query = """select  pizza_name,count(distinct order_id) as 'id' from pizza_sales
group by pizza_name order by id desc limit 5"""

pd.read_sql_query(query, conn, index_col=None)

C:\Users\admin\AppData\Local\Temp\ipykernel_8000\506580355.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, conn, index_col=None)

                   pizza_name    id
0    The Classic Deluxe Pizza  2329
1          The Hawaiian Pizza  2280
2         The Pepperoni Pizza  2278
3  The Barbecue Chicken Pizza  2273
4      The Thai Chicken Pizza  2225